# applymap 변환
 * 단일 원소 변환

In [4]:
import numpy as np
import pandas as pd

In [6]:
np.random.seed(0)
df = pd.DataFrame(np.random.randn(4, 3), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'LA'])
df

              b         d         e
Utah   1.764052  0.400157  0.978738
Ohio   2.240893  1.867558 -0.977278
Texas  0.950088 -0.151357 -0.103219
LA     0.410599  0.144044  1.454274

In [10]:
format = lambda x: '%.2f' % x # 둘째자리까지 나타냄
df2 = df.applymap(format)
df2

          b      d      e
Utah   1.76   0.40   0.98
Ohio   2.24   1.87  -0.98
Texas  0.95  -0.15  -0.10
LA     0.41   0.14   1.45

In [11]:
df.values.dtype, df2.values.dtype

(dtype('float64'), dtype('O'))

# apply 변환
 * row/column 변환

In [12]:
df = pd.DataFrame({'Qu1':[1,3,4,3,5], 'Qu2':[2,3,1,2,3], 'Qu3':[1,5,2,4,4]})
df

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    5    3    4

In [13]:
f = lambda x: 2*x
df.apply(f)

   Qu1  Qu2  Qu3
0    2    4    2
1    6    6   10
2    8    2    4
3    6    4    8
4   10    6    8

In [14]:
f = lambda x : x.max() - x.min()
df.apply(f)

Qu1    4
Qu2    2
Qu3    4
dtype: int64

In [15]:
df.apply(f, axis=1)

0    1
1    2
2    3
3    2
4    2
dtype: int64

In [16]:
df.apply(pd.value_counts)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  1.0  NaN  2.0
5  1.0  NaN  1.0

In [17]:
df.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  1.0  0.0  2.0
5  1.0  0.0  1.0

# 데이터 프레임과 시리즈의 연산
 * 데이터프레임의 각 행을 같은 크기의 시리즈와 연산하면 반복 연산(브로드캐스팅)을 한다. 다만 열은 연산이 되지 않으므로 전치 연산을 통해야 한다.

In [20]:
df/df.ix[0]

   Qu1  Qu2  Qu3
0  1.0  1.0  1.0
1  3.0  1.5  5.0
2  4.0  0.5  2.0
3  3.0  1.0  4.0
4  5.0  1.5  4.0

In [21]:
(df.T/df.ix[:,0]).T

   Qu1       Qu2       Qu3
0  1.0  2.000000  1.000000
1  1.0  1.000000  1.666667
2  1.0  0.250000  0.500000
3  1.0  0.666667  1.333333
4  1.0  0.600000  0.800000

# CUT / QCUT
 * 실수 자료를 카테고리 자료로 변환
 * cut : bins를 사용자 지정
 * qcut : quantile 기준

In [22]:
ages = [20, 22, 25, 27, 21, 23, 37, 41, 54, 34, 23, 43]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (35, 60], (35, 60], (25, 35], (18, 25], (35, 60]]
Length: 12
Categories (4, object): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [23]:
cats.categories

Index([u'(18, 25]', u'(25, 35]', u'(35, 60]', u'(60, 100]'], dtype='object')

In [24]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 2, 2, 1, 0, 2], dtype=int8)

In [25]:
pd.cut(ages, [20, 25, 37, 41, 54], right = False)

[[20, 25), [20, 25), [25, 37), [25, 37), [20, 25), ..., [41, 54), NaN, [25, 37), [20, 25), [41, 54)]
Length: 12
Categories (4, object): [[20, 25) < [25, 37) < [37, 41) < [41, 54)]

In [36]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., MiddleAged, MiddleAged, YoungAdult, Youth, MiddleAged]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [27]:
df = pd.DataFrame(ages, columns=["ages"])
df.tail()

    ages
7     41
8     54
9     34
10    23
11    43

In [29]:
df["age_cat"] = pd.cut(df.ages, bins, labels=group_names)
df

    ages     age_cat
0     20       Youth
1     22       Youth
2     25       Youth
3     27  YoungAdult
4     21       Youth
5     23       Youth
6     37  MiddleAged
7     41  MiddleAged
8     54  MiddleAged
9     34  YoungAdult
10    23       Youth
11    43  MiddleAged

In [30]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(0.584, 2.759], (-0.058, 0.584], (-0.058, 0.584], (-0.058, 0.584], (0.584, 2.759], ..., [-3.0461, -0.705], (-0.058, 0.584], (-0.058, 0.584], [-3.0461, -0.705], (0.584, 2.759]]
Length: 1000
Categories (4, object): [[-3.0461, -0.705] < (-0.705, -0.058] < (-0.058, 0.584] < (0.584, 2.759]]

In [31]:
pd.value_counts(cats)

(0.584, 2.759]       250
(-0.058, 0.584]      250
(-0.705, -0.058]     250
[-3.0461, -0.705]    250
dtype: int64

In [32]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.058, 1.212], (-0.058, 1.212], (-0.058, 1.212], (-0.058, 1.212], (1.212, 2.759], ..., [-3.0461, -1.304], (-0.058, 1.212], (-0.058, 1.212], (-1.304, -0.058], (1.212, 2.759]]
Length: 1000
Categories (4, object): [[-3.0461, -1.304] < (-1.304, -0.058] < (-0.058, 1.212] < (1.212, 2.759]]

# Pandas 데이터 합성

## Merge
 * 데이터베이스 join 방식
 * inner, outer, left, right

## merge 예제 1

In [37]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1' : range(7)})
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [38]:
df2 = pd.DataFrame({'key':['a', 'b', 'd'], 'data2': range(3)})
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [39]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [40]:
pd.merge(df1, df2, how = 'outer')

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

In [41]:
pd.merge(df1, df2, how='left')

   data1 key  data2
0      0   b    1.0
1      1   b    1.0
2      2   a    0.0
3      3   c    NaN
4      4   a    0.0
5      5   a    0.0
6      6   b    1.0

In [42]:
pd.merge(df1, df2, how='right')

   data1 key  data2
0    0.0   b      1
1    1.0   b      1
2    6.0   b      1
3    2.0   a      0
4    4.0   a      0
5    5.0   a      0
6    NaN   d      2

# merge 예제 2

In [43]:
df1 = pd.DataFrame({'key1' : ['foo', 'foo', 'bar'], 'key2' : ['one', 'two', 'one' ], 'lval':[1,2,3] })
df1

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [45]:
df2 = pd.DataFrame({'key1' : ['foo', 'foo', 'bar', 'bar'], 'key2' : ['one', 'two', 'one', 'two' ], 'lval':[4,5,6,7] })
df2

  key1 key2  lval
0  foo  one     4
1  foo  two     5
2  bar  one     6
3  bar  two     7

In [46]:
pd.merge(df1, df2, how='outer')

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3
3  foo  one     4
4  foo  two     5
5  bar  one     6
6  bar  two     7

In [47]:
pd.merge(df1, df2, on=['key1', 'key2'], how='outer')

  key1 key2  lval_x  lval_y
0  foo  one     1.0       4
1  foo  two     2.0       5
2  bar  one     3.0       6
3  bar  two     NaN       7

In [48]:
pd.merge(df1, df2, on='key1')

  key1 key2_x  lval_x key2_y  lval_y
0  foo    one       1    one       4
1  foo    one       1    two       5
2  foo    two       2    one       4
3  foo    two       2    two       5
4  bar    one       3    one       6
5  bar    one       3    two       7

In [49]:
pd.merge(df1, df2, on = 'key1', suffixes=('_left', '_right'))

  key1 key2_left  lval_left key2_right  lval_right
0  foo       one          1        one           4
1  foo       one          1        two           5
2  foo       two          2        one           4
3  foo       two          2        two           5
4  bar       one          3        one           6
5  bar       one          3        two           7

# merge 예제3

In [50]:
df1 = pd.DataFrame({'key1' : ['foo', 'foo', 'bar'], 'key2' : ['one', 'two', 'one' ], 'lval':[1,2,3] })
df1

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [52]:
df2 = pd.DataFrame({'k1' : ['foo', 'foo', 'bar', 'bar'], 'k2' : ['one', 'two', 'one', 'two' ], 'lval':[4,5,6,7] })
df2

    k1   k2  lval
0  foo  one     4
1  foo  two     5
2  bar  one     6
3  bar  two     7

In [53]:
pd.merge(df1, df2, left_on = 'key1', right_on="k1")

  key1 key2  lval_x   k1   k2  lval_y
0  foo  one       1  foo  one       4
1  foo  one       1  foo  two       5
2  foo  two       2  foo  one       4
3  foo  two       2  foo  two       5
4  bar  one       3  bar  one       6
5  bar  one       3  bar  two       7

# merge 예제 4

In [54]:
df1 = pd.DataFrame({'key': ['a','b','a','a','b','c'], 'value':range(6)})
df1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [55]:
df2 = pd.DataFrame({'group_val' : [3.5, 7]}, index=['a', 'b'])
df2

   group_val
a        3.5
b        7.0

In [56]:
pd.merge(df1, df2, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

# merge 예제 5

In [57]:
df1 = pd.DataFrame({'key1':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'key2' : [2000, 2001, 2002, 2001, 2002], 'data':np.arange(5.) })
df1

   data    key1  key2
0   0.0    Ohio  2000
1   1.0    Ohio  2001
2   2.0    Ohio  2002
3   3.0  Nevada  2001
4   4.0  Nevada  2002

In [61]:
df2 = pd.DataFrame(np.arange(12).reshape((6, 2)), index = [['Nevada', 'Nevada', 'Ohio', 'Ohio', 'Ohio', 'Ohio'], [2001, 2000, 2000, 2000, 2001, 2002]], columns=['event1', 'event2'])
df2

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [62]:
pd.merge(df1, df2, left_on=['key1', 'key2'], right_index=True)

   data    key1  key2  event1  event2
0   0.0    Ohio  2000       4       5
0   0.0    Ohio  2000       6       7
1   1.0    Ohio  2001       8       9
2   2.0    Ohio  2002      10      11
3   3.0  Nevada  2001       0       1

# merge 예제6

In [63]:
df1 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]], index = ['a', 'c', 'e'], columns = ['Ohio', 'Nevada'])
df1

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [64]:
df2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]], index = ['b', 'c', 'd', 'e'], columns = ['Missouri', 'Alabama'])
df2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [65]:
pd.merge(df1, df2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

# join 메서드

In [66]:
df1.join(df2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

# Concat
 * Key Column을 사용하지 않고 Index값만 사용하여 결합

In [68]:
s1 = pd.Series([0, 1], index = ['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index = ['f', 'g'] )

In [69]:
s1

a    0
b    1
dtype: int64

In [70]:
s2

c    2
d    3
e    4
dtype: int64

In [71]:
s3

f    5
g    6
dtype: int64

In [72]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [73]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [74]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2), index = ['a', 'b', 'c'], columns = ['one', 'two'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [75]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2,2), index = ['a', 'c'], columns = ['three', 'four'])
df2

   three  four
a      5     6
c      7     8

In [76]:
pd.concat([df1, df2])

   four  one  three  two
a   NaN  0.0    NaN  1.0
b   NaN  2.0    NaN  3.0
c   NaN  4.0    NaN  5.0
a   6.0  NaN    5.0  NaN
c   8.0  NaN    7.0  NaN

In [77]:
pd.concat([df1, df2], axis=1)

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0